app/controllers/students_controller.rb

UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "so"], ["last_name", "so"], ["updated_at", "2021-03-05 02:05:56.808566"], ["id", 3]]
---
  def update
    @student.update(first_name: params[:student][:first_name], last_name: params[:student][:last_name])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def find_student
    @student=Student.find_by_id(params[:id])